class HttpStatusHelper {
  static String translateToMessage(int status) {
    switch (status) {
      case 200:
        return "درخواست با موفقیت انجام شد";
      case 201:
        return "با موفقیت ایجاد شد";
      case 400:
        return "سرور به دلیل یک خطای مشتری نمی تواند درخواست را بفهمد و پردازش کند. داده های از دست رفته، "
            "اعتبارسنجی دامنه و قالب بندی نامعتبر نمونه هایی هستند که باعث ارسال کد وضعیت 400 می شوند.";
      case 401:
        return "احراز هویت ناموفق بود لطفا اطلاعات خود را بررسی و مجددا تلاش کنید ";
      case 403:
        return "این کاربر مجوز های لازم را ندارد لطفا با کاربری دیگر وارد شوید";
      case 404:
        return "منبع در سرور یافت نشد";
      case 410:
        return "منبع درخواستی دیگر در دسترس نیست و دوباره در دسترس نخواهد بود";
      case 500:
        return " خطای سرور ";
      default:
        return "خطای نامشخص، از صحت نام دامنه مطمئن شوید. Status code: $status";
    }
  }
}
